tiborsimon/embedded-tdd-headers/pic/8bit/pic12ce673_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12CE673_H_
#define _PIC12CE673_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define RP0                           11
#define RP                            12
#define RP1                           13
#define IRP                           14
#define FSR                           15
#define GPIO                          16
#define GP0                           17
#define GP1                           18
#define GP2                           19
#define GP3                           20
#define GP4                           21
#define GP5                           22
#define SDA                           23
#define SCL                           24
#define PCLATH                        25
#define INTCON                        26
#define GPIF                          27
#define INTF                          28
#define T0IF                          29
#define GPIE                          30
#define INTE                          31
#define T0IE                          32
#define PEIE                          33
#define GIE                           34
#define PIR1                          35
#define ADIF                          36
#define ADRES                         37
#define ADCON0                        38
#define ADON                          39
#define nDONE                         40
#define GO_nDONE                      41
#define GO_DONE                       42
#define GO                            43
#define CHS0                          44
#define CHS                           45
#define CHS1                          46
#define ADCS0                         47
#define ADCS                          48
#define ADCS1                         49
#define OPTION_REG                    50
#define PS                            51
#define PS0                           52
#define PS1                           53
#define PS2                           54
#define PSA                           55
#define T0SE                          56
#define T0CS                          57
#define INTEDG                        58
#define nGPPU                         59
#define TRIS                          60
#define TRIS0                         61
#define TRIS1                         62
#define TRIS2                         63
#define TRIS3                         64
#define TRIS4                         65
#define TRIS5                         66
#define PIE1                          67
#define ADIE                          68
#define PCON                          69
#define nPOR                          70
#define OSCCAL                        71
#define CALSLW                        72
#define CALFST                        73
#define CAL0                          74
#define CAL                           75
#define CAL1                          76
#define CAL2                          77
#define CAL3                          78
#define ADCON1                        79
#define PCFG0                         80
#define PCFG                          81
#define PCFG1                         82
#define PCFG2                         83

#endif // _PIC12CE673_H_
